// Задача 64: Написать рекурсивную функцию перевода 
// из десятичной системы исчисления в двоичную.


// int Binar(int number){

// }
// Console.Write("Please, enter your number: ");
// int number = Convert.ToInt32(Console.ReadLine());